{
  "backend/main.mo": "Main Motoko actor for a trading journal app that manages user trades, profiles, strategies, and risk settings with role-based access control and per-user data isolation.",
  "backend/migration.mo": "Migration module that upgrades the actor state from an older schema (without strategies) to the new schema by adding an empty strategies map.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs to their associated source files, components, and test requirement IDs for traceability.",
  "frontend-file-summaries.txt": "A JSON document containing one-line summaries of each frontend source file, serving as a reference for the purpose and key functionality of every frontend component, page, hook, and utility.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes including colors, borders, charts, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML shell for the Trading Journal SPA that mounts the React app into a root div and loads the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router, React Query, dark ThemeProvider, and an AuthGuard that gates all routes behind Internet Identity authentication and shows a ProfileSetupModal for new users.",
  "frontend/src/components/EditTradeModal.tsx": "A modal dialog component for editing an existing trade's fields (entry price, stop loss, target, P&L, strategy, emotion, notes) with form validation and a mutation call to update the trade.",
  "frontend/src/components/Layout.tsx": "The main app layout component providing a sidebar with navigation links, user profile display, and a logout button, with mobile drawer support.",
  "frontend/src/components/LoginScreen.tsx": "A full-page login screen that authenticates users via Internet Identity, displaying app branding, feature highlights, and login status feedback.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog shown to new users to enter and save their trader display name before accessing the app.",
  "frontend/src/components/StrategyAutocomplete.tsx": "A text input with dropdown autocomplete for selecting trading strategies, supporting substring and abbreviation matching with keyboard navigation.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor using the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "A React Query hook that fetches the currently authenticated user's profile from the backend actor, waiting until the actor is ready.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend actor operations including CRUD for trades, strategies, risk settings, and backup/restore functionality.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "Provides a mutation hook to save the caller's user profile via the backend actor, invalidating the cached profile query on success.",
  "frontend/src/index.css": "Global stylesheet defining CSS custom properties for a dark theme, Tailwind base/component/utility layers, and reusable component classes like glassmorphism cards and neon buy/sell buttons.",
  "frontend/src/lib/tradeUtils.ts": "Utility functions for trade calculations including P&L, risk/reward ratio, formatting helpers, and aggregation functions for overall and monthly trade statistics.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AnalyticsPage.tsx": "Analytics dashboard page that displays monthly P&L bar charts, emotion distribution pie charts, and a sortable strategy performance table derived from trade data.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the main dashboard with summary stat cards, a 7-day P&L area chart, and a recent trades list using data from the useGetTrades hook.",
  "frontend/src/pages/NewTradePage.tsx": "Provides a form for logging a new trade, including fields for entry/exit prices, conviction rating, risk calculator, emotions, and mistakes, then submits via the useAddTrade hook.",
  "frontend/src/pages/RiskManagementPage.tsx": "Displays live P&L risk status against configurable account size and daily max loss limits, and provides export/import backup functionality.",
  "frontend/src/pages/SettingsPage.tsx": "Shows app info and theme details, and provides a strategy manager UI that lists saved strategies with the ability to delete them via the useDeleteStrategy hook.",
  "frontend/src/pages/TradeLogPage.tsx": "Renders a filterable, searchable list of all logged trades with support for expanding trade details, editing via a modal, and deleting individual trades.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, CSS-variable-based color tokens, border radii, box shadows, keyframe animations, and plugin registrations for a trading journal UI.",
  "project_state.json": "Project state manifest (version 3) describing the Trading Journal app's existing features, architectural notes, and requirements including strategy analytics, trade editing, and autocomplete strategy memory."
}