{
  "backend/main.mo": "Main actor for the trading journal backend, defining Trade and UserProfile types, per-user data storage, and shared/query functions for managing trades, account settings, risk parameters, and user profiles with access control.",
  "backend/migration.mo": "Data migration module that upgrades stored actor state by adding a default `convictionLevel = 3` field to all existing trades for each user.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs (glassmorphism styling, neon Buy/Sell buttons, sidebar icons, P&L chart, etc.) to the frontend files and components that satisfy each requirement.",
  "frontend-file-summaries.txt": "JSON dictionary of one-line summaries for each frontend source file, describing the purpose of every page, component, hook, and config file in the project.",
  "frontend/index.css": "Base Tailwind CSS entry point defining OKLCH CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "Minimal HTML shell that mounts the React app into a `#root` div and loads the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all page routes, React Query client, dark ThemeProvider, and a global Toaster notification component.",
  "frontend/src/components/Layout.tsx": "App shell component rendering a glassmorphism sidebar with 22px lucide-react nav icons, active state indicators, user profile display, logout button, and a mobile overlay toggle.",
  "frontend/src/components/LoginScreen.tsx": "Renders the login page for the Operator Trading Journal app, displaying branding, feature highlights, and an Internet Identity login button with loading/error states.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts a newly authenticated user to enter their trader name and saves it via the useSaveCallerUserProfile hook.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated (or anonymous) ICP backend actor using TanStack Query, and invalidates dependent queries whenever the identity changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React hook that fetches the current authenticated user's profile from the backend actor using TanStack Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flows, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Collection of TanStack Query hooks for all backend data operations including trades (CRUD), account size, daily max loss, and backup functionality.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "Mutation hook that saves the caller's user profile to the backend actor and invalidates the cached profile query on success.",
  "frontend/src/index.css": "Global stylesheet defining CSS custom properties for the dark trading-themed design system (colors, radius, profit/loss tokens) and reusable component classes like glassmorphism cards and neon buy/sell buttons.",
  "frontend/src/lib/tradeUtils.ts": "Utility functions for trade calculations (PnL, risk, R:R ratio), formatting (currency, numbers, dates), and aggregation helpers including overall stats, monthly breakdowns, and CSV export.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AnalyticsPage.tsx": "Analytics dashboard page that visualizes trade data through monthly P&L bar charts, emotion analysis, buy/sell direction pie charts, and mistake frequency charts using Recharts.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying summary stat cards and a 7-day P&L area chart built with Recharts, pulling trade data via the useGetTrades hook.",
  "frontend/src/pages/NewTradePage.tsx": "Form page for logging a new trade, featuring a live risk calculator, conviction star meter, and dropdown selectors for emotion, setup type, and mistake options.",
  "frontend/src/pages/RiskManagementPage.tsx": "Risk management page for configuring account size and daily max loss limits, displaying live P&L status with over-limit alerts, and handling JSON backup export/import.",
  "frontend/src/pages/SettingsPage.tsx": "Simple static settings page showing app version/about info and a note about the fixed dark theme.",
  "frontend/src/pages/TradeLogPage.tsx": "A React page that displays a filterable, searchable trade log table with options to delete trades, showing details like stock name, direction, P&L, conviction stars, and mistakes. Includes filter controls for direction, trade type, strategy, and mistake type.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to extract URL parameters from both query strings and hash-based routes, persist them in sessionStorage, and clean sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts (Inter, Space Grotesk), CSS-variable-based color tokens, glassmorphism/neon box shadows, and accordion/glow animations, plus typography and container-queries plugins.",
  "project_state.json": "Project state metadata file describing the dark-themed Trading Journal app's architecture, existing features (glassmorphism, neon buttons, P&L chart, risk-reward calculator, etc.), known issues, and versioning information."
}