{
  "kind": "build_request",
  "title": "Strategy Analytics, Edit Trade & Smart Strategy Autocomplete",
  "projectName": "EmpireTradeX",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Extend the backend actor to support a 'strategies' collection per user. Add the following functions: (1) saveStrategy(name: Text) – stores a strategy name under the caller's user ID if it doesn't already exist; (2) getStrategies() – returns all strategy names for the caller; (3) deleteStrategy(name: Text) – removes a strategy by name for the caller. Strategy records must be linked to user principal and include a createdAt timestamp.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Create a separate table/collection called 'strategies'",
          "Link strategies to user_id",
          "Add ability to delete unused strategies from settings"
        ]
      },
      "acceptanceCriteria": [
        "saveStrategy stores a new strategy name only if it does not already exist for that user",
        "getStrategies returns only the calling user's strategies",
        "deleteStrategy removes the specified strategy for the calling user",
        "All strategy operations are gated behind authentication (caller principal check)"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add an updateTrade function to the backend actor that accepts a trade ID and an update record with fields: entry (Float), stopLoss (Float), target (Float), pnl (Float), strategy (Text), emotion (Text), notes (Text). The function must update the specified trade for the authenticated caller, set an updatedAt timestamp, and return the updated trade. Only the trade owner may update their own trades.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Allow updating: Entry, Stop Loss, Target, P&L, Strategy, Emotion, Notes",
          "Maintain updated_at timestamp"
        ]
      },
      "acceptanceCriteria": [
        "updateTrade rejects calls from users who do not own the specified trade",
        "All specified fields are updated and persisted",
        "The updatedAt timestamp is set to the current time on every update",
        "The updated trade is returned on success"
      ]
    },
    {
      "id": "REQ-3",
      "text": "When a trade is saved (new trade creation) and the strategy field is non-empty, automatically call saveStrategy with the strategy name so it is stored in the strategies collection. This must happen server-side inside the trade creation handler.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Whenever a new strategy is typed and saved in a trade, automatically store it in the strategies table (if not already exists)"
        ]
      },
      "acceptanceCriteria": [
        "Creating a trade with a new strategy name automatically persists that strategy in the strategies collection",
        "Creating a trade with an already-existing strategy does not create a duplicate",
        "Creating a trade without a strategy name does not store an empty strategy"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add React Query hooks in useQueries.ts for the three new backend functions: useGetStrategies (fetches all strategies for current user), useSaveStrategy (mutation), and useDeleteStrategy (mutation). Also add an useUpdateTrade mutation hook that calls the backend updateTrade function and invalidates the trades query on success.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Update analytics in real-time after trade edit"
        ]
      },
      "acceptanceCriteria": [
        "useGetStrategies returns the user's strategy list and is refetched when a strategy is added or deleted",
        "useUpdateTrade mutation invalidates the trades cache so analytics re-render automatically after an edit",
        "All hooks pass the authenticated actor from useActor"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add a Strategy Performance Analytics section to AnalyticsPage.tsx. Group the user's trades by strategy name and compute per-strategy metrics: Total Trades, Win Rate %, Total P&L, Average R:R, and Average Risk. Display results in two ways: (1) a sortable table where clicking any column header sorts by that column, and (2) a bar chart (using Recharts) showing Total P&L per strategy. Automatically highlight the best-performing strategy (highest Total P&L) with a distinct visual indicator (e.g., a gold badge or highlighted row). If a trade has no strategy, group it under 'Untagged'.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Add a new analytics section called 'Strategy Performance'",
          "Group trades by strategy name",
          "Display it in a sortable table and also a bar chart",
          "Highlight the best performing strategy automatically"
        ]
      },
      "acceptanceCriteria": [
        "Strategy Performance section appears on the Analytics page",
        "Table displays all five metrics per strategy: Total Trades, Win Rate %, Total P&L, Avg R:R, Avg Risk",
        "Clicking a column header sorts the table by that column (asc/desc toggle)",
        "Bar chart renders Total P&L per strategy using Recharts",
        "The best-performing strategy (highest Total P&L) is visually highlighted in both the table and the chart",
        "Trades without a strategy are grouped as 'Untagged'"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add an Edit button to each trade card/row in TradeLogPage.tsx. Clicking Edit opens a modal pre-filled with the trade's current data. The modal must include editable fields for: Entry, Stop Loss, Target, P&L, Strategy (with autocomplete, see REQ-7), Emotion, and Notes. On submit, call the useUpdateTrade mutation. On success, close the modal and invalidate the trades and analytics queries so all data refreshes automatically.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Add an Edit button on each trade card",
          "open a modal with pre-filled existing trade data",
          "After update, refresh analytics automatically"
        ]
      },
      "acceptanceCriteria": [
        "Each trade card/row in the Trade Log has a visible Edit button",
        "Clicking Edit opens a modal with all specified fields pre-filled with current trade values",
        "All seven fields are editable in the modal",
        "Submitting the modal calls updateTrade and shows a loading state during the request",
        "On success, the modal closes and the trade list and analytics section refresh with updated data",
        "On error, an error message is shown inside the modal without closing it"
      ]
    },
    {
      "id": "REQ-7",
      "text": "Replace the plain strategy text input (in both NewTradePage.tsx and the Edit Trade modal) with a smart autocomplete input component. The component must: (1) fetch strategies via useGetStrategies; (2) filter suggestions case-insensitively as the user types; (3) support keyword/abbreviation matching so partial tokens match anywhere in the strategy name (e.g., typing '90' suggests '90 EMA Pullback', typing 'SR' suggests 'Support & Resistance'); (4) show a dropdown list of matching suggestions; (5) allow selection via mouse click or keyboard (arrow keys + Enter); (6) dismiss on Escape or outside click. The strategy value is still saved as free text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "show autocomplete suggestions",
          "Typing '90' should instantly suggest '90 EMA Pullback'",
          "Typing 'SR' should suggest 'Support & Resistance'",
          "Suggestions must be case-insensitive and fast"
        ]
      },
      "acceptanceCriteria": [
        "Autocomplete dropdown appears while typing in the strategy field",
        "Suggestions filter case-insensitively and match substrings anywhere in the strategy name",
        "Abbreviations like 'SR' match strategies containing words starting with those letters",
        "Keyboard navigation (arrow keys, Enter, Escape) works correctly",
        "The component works in both NewTradePage and the Edit Trade modal",
        "If no suggestions match, the dropdown is hidden and the typed value is used as-is"
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add a 'Strategy Manager' section to SettingsPage.tsx. Display the user's saved strategies as a list with a Delete button next to each entry. Clicking Delete calls the useDeleteStrategy mutation and removes it from the list. Show an empty state message if no strategies are saved.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Add ability to delete unused strategies from settings"
        ]
      },
      "acceptanceCriteria": [
        "SettingsPage includes a 'Strategy Manager' section listing all saved strategies",
        "Each strategy entry has a Delete button",
        "Clicking Delete removes the strategy and the list updates immediately",
        "An empty-state message is shown when no strategies exist",
        "The section matches the existing dark UI theme of SettingsPage"
      ]
    },
    {
      "id": "REQ-9",
      "text": "Generate a migration module (backend/migration.mo) that adds the new 'strategies' stable data structure to the existing state without breaking existing trade records. The migration should be safe to run on upgrade and must preserve all existing trade data intact.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Return updated backend schema + frontend logic"
        ]
      },
      "acceptanceCriteria": [
        "migration.mo initializes the strategies stable variable on canister upgrade",
        "All existing trade records are preserved after migration",
        "No data loss occurs when upgrading from the previous schema"
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "All backend functions must verify the caller's principal before accessing or modifying user data",
    "New UI components must match the existing dark glassmorphism theme defined in frontend/src/index.css and tailwind.config.js",
    "Use Recharts for all chart components, consistent with existing AnalyticsPage.tsx and DashboardPage.tsx"
  ],
  "nonGoals": [
    "Adding new market types or trade fields beyond those listed",
    "Real-time WebSocket or push-notification updates",
    "Sharing or exporting strategy data between users",
    "Any changes to the authentication flow or Internet Identity integration"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}