{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Strategy Analytics, Edit Trade & Smart Strategy Autocomplete",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Add React Query hooks for strategy management and trade updates",
      "acceptanceCriteria": [
        "useGetStrategies returns the user's strategy list and is refetched when a strategy is added or deleted",
        "useUpdateTrade mutation invalidates the trades cache so analytics re-render automatically after an edit",
        "All hooks pass the authenticated actor from useActor"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add four new React Query hooks: useGetStrategies (query that fetches all strategies for the current user using actor.getStrategies), useSaveStrategy (mutation that calls actor.saveStrategy and invalidates the strategies query), useDeleteStrategy (mutation that calls actor.deleteStrategy and invalidates the strategies query), and useUpdateTrade (mutation that calls actor.updateTrade with tradeId and UpdateTradeRecord, then invalidates both 'trades' and 'riskStatus' queries on success to ensure analytics refresh automatically). All hooks must use the authenticated actor from useActor and follow the existing hook patterns in the file."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add Strategy Performance Analytics section with sortable table and bar chart",
      "acceptanceCriteria": [
        "Strategy Performance section appears on the Analytics page",
        "Table displays all five metrics per strategy: Total Trades, Win Rate %, Total P&L, Avg R:R, Avg Risk",
        "Clicking a column header sorts the table by that column (asc/desc toggle)",
        "Bar chart renders Total P&L per strategy using Recharts",
        "The best-performing strategy (highest Total P&L) is visually highlighted in both the table and the chart",
        "Trades without a strategy are grouped as 'Untagged'"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AnalyticsPage.tsx",
          "operation": "modify",
          "description": "Add a new Strategy Performance Analytics section after the existing charts. Group trades by strategy name (or 'Untagged' for empty strategy fields) and compute per-strategy metrics: Total Trades count, Win Rate % (winning trades / total trades * 100), Total P&L sum, Average R:R (mean risk:reward ratio), and Average Risk (mean distance from entry to stop loss). Render two visualizations: (1) a sortable HTML table with column headers that toggle sort order (asc/desc) on click, styling the best-performing strategy row (highest Total P&L) with a gold badge or highlighted background, and (2) a Recharts BarChart component showing Total P&L per strategy with the best-performing bar highlighted using a distinct fill color. Use the existing dark glassmorphism card styling and Recharts theme from the rest of the page. Import necessary utilities from frontend/src/lib/tradeUtils.ts for calculations."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Add Edit button and modal to trade cards for updating trade details",
      "acceptanceCriteria": [
        "Each trade card/row in the Trade Log has a visible Edit button",
        "Clicking Edit opens a modal with all specified fields pre-filled with current trade values",
        "All seven fields are editable in the modal",
        "Submitting the modal calls updateTrade and shows a loading state during the request",
        "On success, the modal closes and the trade list and analytics section refresh with updated data",
        "On error, an error message is shown inside the modal without closing it"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/EditTradeModal.tsx",
          "operation": "create",
          "description": "Create a modal component that accepts a Trade object as a prop and renders a form with seven editable fields: Entry (number input), Stop Loss (number input), Target (number input), P&L (number input), Strategy (use the StrategyAutocomplete component from REQ-7), Emotion (text input or select), and Notes (textarea). Pre-fill all fields with the current trade values. On submit, call the useUpdateTrade mutation hook with the trade ID and updated values. Display a loading spinner during submission. On success, close the modal. On error, display the error message inline without closing the modal. Style the modal with the existing dark glassmorphism theme matching other modals in the app. Include a Close/Cancel button."
        },
        {
          "path": "frontend/src/pages/TradeLogPage.tsx",
          "operation": "modify",
          "description": "Add an Edit button to each trade card/row alongside the existing Delete button. Import and render the EditTradeModal component with state management to control its visibility. Pass the selected trade to the modal when Edit is clicked. The modal should close automatically on successful update, triggering the trade list to refresh via query invalidation handled by the useUpdateTrade hook."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Create smart autocomplete component for strategy input with keyword matching",
      "acceptanceCriteria": [
        "Autocomplete dropdown appears while typing in the strategy field",
        "Suggestions filter case-insensitively and match substrings anywhere in the strategy name",
        "Abbreviations like 'SR' match strategies containing words starting with those letters",
        "Keyboard navigation (arrow keys, Enter, Escape) works correctly",
        "The component works in both NewTradePage and the Edit Trade modal",
        "If no suggestions match, the dropdown is hidden and the typed value is used as-is"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/StrategyAutocomplete.tsx",
          "operation": "create",
          "description": "Create a reusable autocomplete input component that accepts value and onChange props. Use the useGetStrategies hook to fetch the user's saved strategies. As the user types, filter suggestions case-insensitively using two matching modes: (1) substring match anywhere in the strategy name (e.g., '90' matches '90 EMA Pullback'), and (2) abbreviation match where each typed letter matches the first letter of a word in the strategy name (e.g., 'SR' matches 'Support & Resistance'). Render a dropdown list of matching suggestions below the input. Support keyboard navigation: arrow keys to navigate suggestions, Enter to select the highlighted suggestion, Escape to close the dropdown. Also support mouse click selection. Dismiss the dropdown on outside click using a ref and click-outside handler. Style the component and dropdown with the existing dark glassmorphism theme. The value is stored as free text, so allow any typed value even if it doesn't match suggestions."
        },
        {
          "path": "frontend/src/pages/NewTradePage.tsx",
          "operation": "modify",
          "description": "Replace the plain strategy text input field with the StrategyAutocomplete component. Pass the current strategy value and the onChange handler to the component. Remove the old text input JSX and import the new StrategyAutocomplete component."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Add Strategy Manager section to Settings page for deleting saved strategies",
      "acceptanceCriteria": [
        "SettingsPage includes a 'Strategy Manager' section listing all saved strategies",
        "Each strategy entry has a Delete button",
        "Clicking Delete removes the strategy and the list updates immediately",
        "An empty-state message is shown when no strategies exist",
        "The section matches the existing dark UI theme of SettingsPage"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SettingsPage.tsx",
          "operation": "modify",
          "description": "Add a new 'Strategy Manager' section below the existing content. Use the useGetStrategies hook to fetch the user's saved strategies and display them in a list. For each strategy, show the strategy name and a Delete button. Wire the Delete button to the useDeleteStrategy mutation hook. When the hook succeeds, the list will automatically refresh via query invalidation. If no strategies exist (empty array or loading state resolved with no items), display an empty-state message like 'No saved strategies yet. Strategies are automatically saved when you log trades.' Style the section with the existing dark glassmorphism card theme matching the rest of the Settings page."
        }
      ]
    }
  ]
}