{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Trading Journal app with advanced features: Strategy Performance Analytics, Edit Trade functionality, and Auto-Save Strategy Memory with smart autocomplete suggestions.",
  "architectural_notes": [
    "Strategies stored in a separate 'strategies' table/collection linked to user_id",
    "Analytics must update in real-time after any trade edit",
    "Authentication must be enforced on all trade and strategy endpoints"
  ],
  "known_issues": [],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-add-react-query-hooks-in-usequeries-ts-for-the-three-new-backend-functions-usegetstrategies-fetches-all-strategies-for-current-user-usesavestrategy-mutation-and-usedeletestrategy-mutation-also-add-an-useupdatetrade-mutation-hook-that-calls-the-backend-updatetrade-function-and-invalidates-the-trades-query-on-success",
      "title": "Add React Query hooks in useQueries.ts for the three new backend functions: useGetStrategies (fetches all strategies for current user), useSaveStrategy (mutation), and useDeleteStrategy (mutation). Also add an useUpdateTrade mutation hook that calls the backend updateTrade function and invalidates the trades query on success.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "feature-add-a-strategy-performance-analytics-section-to-analyticspage-tsx-group-the-user-s-trades-by-strategy-name-and-compute-per-strategy-metrics-total-trades-win-rate-total-p-l-average-r-r-and-average-risk-display-results-in-two-ways-1-a-sortable-table-where-clicking-any-column-header-sorts-by-that-column-and-2-a-bar-chart-using-recharts-showing-total-p-l-per-strategy-automatically-highlight-the-best-performing-strategy-highest-total-p-l-with-a-distinct-visual-indicator-e-g-a-gold-badge-or-highlighted-row-if-a-trade-has-no-strategy-group-it-under-untagged",
      "title": "Add a Strategy Performance Analytics section to AnalyticsPage.tsx. Group the user's trades by strategy name and compute per-strategy metrics: Total Trades, Win Rate %, Total P&L, Average R:R, and Average Risk. Display results in two ways: (1) a sortable table where clicking any column header sorts by that column, and (2) a bar chart (using Recharts) showing Total P&L per strategy. Automatically highlight the best-performing strategy (highest Total P&L) with a distinct visual indicator (e.g., a gold badge or highlighted row). If a trade has no strategy, group it under 'Untagged'.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    },
    {
      "id": "feature-add-an-edit-button-to-each-trade-card-row-in-tradelogpage-tsx-clicking-edit-opens-a-modal-pre-filled-with-the-trade-s-current-data-the-modal-must-include-editable-fields-for-entry-stop-loss-target-p-l-strategy-with-autocomplete-see-req-7-emotion-and-notes-on-submit-call-the-useupdatetrade-mutation-on-success-close-the-modal-and-invalidate-the-trades-and-analytics-queries-so-all-data-refreshes-automatically",
      "title": "Add an Edit button to each trade card/row in TradeLogPage.tsx. Clicking Edit opens a modal pre-filled with the trade's current data. The modal must include editable fields for: Entry, Stop Loss, Target, P&L, Strategy (with autocomplete, see REQ-7), Emotion, and Notes. On submit, call the useUpdateTrade mutation. On success, close the modal and invalidate the trades and analytics queries so all data refreshes automatically.",
      "reqIds": [
        "REQ-6"
      ],
      "version": 1
    },
    {
      "id": "feature-replace-the-plain-strategy-text-input-in-both-newtradepage-tsx-and-the-edit-trade-modal-with-a-smart-autocomplete-input-component-the-component-must-1-fetch-strategies-via-usegetstrategies-2-filter-suggestions-case-insensitively-as-the-user-types-3-support-keyword-abbreviation-matching-so-partial-tokens-match-anywhere-in-the-strategy-name-e-g-typing-90-suggests-90-ema-pullback-typing-sr-suggests-support-resistance-4-show-a-dropdown-list-of-matching-suggestions-5-allow-selection-via-mouse-click-or-keyboard-arrow-keys-enter-6-dismiss-on-escape-or-outside-click-the-strategy-value-is-still-saved-as-free-text",
      "title": "Replace the plain strategy text input (in both NewTradePage.tsx and the Edit Trade modal) with a smart autocomplete input component. The component must: (1) fetch strategies via useGetStrategies; (2) filter suggestions case-insensitively as the user types; (3) support keyword/abbreviation matching so partial tokens match anywhere in the strategy name (e.g., typing '90' suggests '90 EMA Pullback', typing 'SR' suggests 'Support & Resistance'); (4) show a dropdown list of matching suggestions; (5) allow selection via mouse click or keyboard (arrow keys + Enter); (6) dismiss on Escape or outside click. The strategy value is still saved as free text.",
      "reqIds": [
        "REQ-7"
      ],
      "version": 1
    },
    {
      "id": "feature-add-a-strategy-manager-section-to-settingspage-tsx-display-the-user-s-saved-strategies-as-a-list-with-a-delete-button-next-to-each-entry-clicking-delete-calls-the-usedeletestrategy-mutation-and-removes-it-from-the-list-show-an-empty-state-message-if-no-strategies-are-saved",
      "title": "Add a 'Strategy Manager' section to SettingsPage.tsx. Display the user's saved strategies as a list with a Delete button next to each entry. Clicking Delete calls the useDeleteStrategy mutation and removes it from the list. Show an empty state message if no strategies are saved.",
      "reqIds": [
        "REQ-8"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Strategy Performance Analytics section: group trades by strategy, show Total Trades, Win Rate%, Total P&L, Avg R:R, Avg Risk in sortable table and bar chart with best strategy highlighted",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Edit Trade feature: Edit button on each trade card opens pre-filled modal allowing updates to Entry, Stop Loss, Target, P&L, Strategy, Emotion, Notes with auto-refresh analytics and updated_at timestamp",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Auto-Save Strategy Memory with smart autocomplete: store strategies in separate table linked to user_id, case-insensitive keyword suggestions, keyboard shortcut search, and ability to delete unused strategies from settings",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Extend the backend actor to support a 'strategies' collection per user. Add the following functions: (1) saveStrategy(name: Text) – stores a strategy name under the caller's user ID if it doesn't already exist; (2) getStrategies() – returns all strategy names for the caller; (3) deleteStrategy(name: Text) – removes a strategy by name for the caller. Strategy records must be linked to user principal and include a createdAt timestamp.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Add an updateTrade function to the backend actor that accepts a trade ID and an update record with fields: entry (Float), stopLoss (Float), target (Float), pnl (Float), strategy (Text), emotion (Text), notes (Text). The function must update the specified trade for the authenticated caller, set an updatedAt timestamp, and return the updated trade. Only the trade owner may update their own trades.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "When a trade is saved (new trade creation) and the strategy field is non-empty, automatically call saveStrategy with the strategy name so it is stored in the strategies collection. This must happen server-side inside the trade creation handler.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    },
    {
      "id": "AR-12",
      "summary": "Generate a migration module (backend/migration.mo) that adds the new 'strategies' stable data structure to the existing state without breaking existing trade records. The migration should be safe to run on upgrade and must preserve all existing trade data intact.",
      "reqIds": [
        "REQ-9"
      ],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "Trading Journal",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}